[
  {
    "destination": "Bora Bora, French Polynesia",
    "description": "Iconic turquoise lagoon, synonymous with ultimate luxury. Overwater bungalows reign supreme, many with private pools and direct water access. Expect world-class resorts (St. Regis, Four Seasons), gourmet dining experiences, and high prices. Activities are heavily focused on relaxation, spa treatments, snorkeling/diving in the calm, clear lagoon, romantic sunset cruises, and photography. The vibe is exclusive, romantic, and beach/lagoon-centric. Less focus on deep jungle or rugged adventure, more about pampering and water-based leisure."
  },
  {
    "destination": "Dominica",
    "description": "Known as the 'Nature Island' of the Caribbean. Far less focused on typical white-sand beaches, more on dramatic volcanic landscapes, lush rainforests, mountains, rivers, waterfalls (Trafalgar Falls, Emerald Pool), and boiling lakes. Accommodation ranges from eco-lodges and guesthouses (more rustic) to a few comfortable hotels, not known for ultra-luxury resorts. Activities are dominated by outdoor adventure: hiking the Waitukubuli National Trail, canyoning, diving volcanic vents, whale watching, exploring waterfalls. The vibe is rugged, natural, adventurous, and appeals to eco-tourists rather than luxury seekers. Strong cultural elements with Kalinago heritage."
  },
  {
    "destination": "Isle of Skye, Scotland",
    "description": "Okay, not tropical, but showcases how descriptions work! Dramatic landscapes with rugged mountains (Cuillins), sea lochs, medieval castles (Dunvegan), and picturesque villages (Portree). Offers B&Bs, guesthouses, some boutique hotels - comfort over luxury usually. Vibe is mystical, wild, adventurous. Activities include hiking (Old Man of Storr, Quiraing), photography, exploring castles, boat trips for wildlife (puffins, seals), visiting whisky distilleries. Strong cultural history. Rustic to comfortable, definitely not a beach/palm destination!"
  },
  {
    "destination": "Maldives", 
    "description": "A dream destination renowned for its pristine coral reefs, crystal-clear waters, and luxurious resorts perched over the ocean. Think private islands, lavish overwater villas, and top-tier resorts (like Soneva Fushi and Anantara Veli). With an emphasis on relaxation and exclusivity, expect activities like snorkeling, diving, private beach dinners, spa treatments, and sunset cruises. Ideal for honeymooners, luxury seekers, and those looking to unwind in a tropical paradise. The vibe is serene, romantic, and indulgent, with limited adventure options beyond water activities."
  },
  {
    "destination": "Seychelles", 
    "description": "A tropical paradise featuring lush rainforests, granite rock formations, and some of the world's most stunning beaches (Anse Source d'Argent). Luxury resorts are the norm, but there's a focus on ecological sustainability and local culture. Activities include scuba diving, island-hopping, hiking through nature reserves (like Morne Seychellois), and birdwatching (home to rare species like the Seychelles warbler). The vibe is laid-back, natural, and exclusive with a dose of adventure for nature lovers."
  },
  {
    "destination": "Bali, Indonesia", 
    "description": "Famous for its vibrant culture, stunning beaches, and lush rice terraces. Bali offers a variety of experiences, from the lively streets of Ubud with its artsy vibe and wellness retreats to the laid-back surf spots of Seminyak and Uluwatu. Luxury resorts and private villas are abundant, but there are also budget-friendly options. Activities include yoga retreats, surfing, temple visits, hiking Mount Batur, and exploring the island's waterfalls. The vibe is eclectic, spiritual, cultural, and beach-focused with a good balance of adventure."
  },
  {
    "destination": "Fiji", 
    "description": "A tropical haven of over 300 islands known for its coral reefs, crystal-clear lagoons, and warm, welcoming locals. Famous for its luxury resorts (like Laucala Island and Jean-Michel Cousteau Resort), Fiji offers an array of indulgent activities including world-class snorkeling, diving, sailing, and exploring vibrant coral gardens. There's also a focus on eco-tourism with opportunities for cultural experiences and rainforest treks. The vibe is relaxed, friendly, and focused on both luxury relaxation and tropical adventure."
  },
  {
    "destination": "Saint Lucia", 
    "description": "A breathtaking Caribbean island known for its towering volcanic peaks (the Pitons), lush rainforests, and luxury resorts (like Jade Mountain). Whether you're soaking in natural hot springs or enjoying a secluded beach, Saint Lucia is perfect for couples seeking romance, adventure, and luxury. Activities range from hiking the Pitons, zip-lining through rainforests, snorkeling, diving, to indulging in spa treatments. The vibe is romantic, adventurous, and surrounded by both natural beauty and upscale comfort."
  },
  {
    "destination": "Mauritius", 
    "description": "An island that blends tropical luxury with a rich cultural heritage. Known for its white-sand beaches, turquoise lagoons, and luxury resorts (like One&Only Le Saint Géran), Mauritius offers a variety of activities including water sports (kitesurfing, snorkeling), botanical gardens (Pamplemousses), and hiking Black River Gorges. There's a focus on both adventure and indulgence, with plenty of opportunities for exploration, relaxation, and cultural immersion. The vibe is diverse, welcoming, and balanced between luxury and nature."
  },
  {
    "destination": "Tahiti, French Polynesia", 
    "description": "The largest of the French Polynesian islands, offering a mix of stunning beaches, cultural experiences, and majestic mountains. Tahiti is ideal for those seeking luxury resorts (like The InterContinental Tahiti Resort) combined with authentic Polynesian culture. Explore the island's black-sand beaches, visit traditional villages, or hike through lush valleys. Activities include surfing, snorkeling in lagoons, cultural tours, and enjoying the island's renowned French-influenced cuisine. The vibe is serene, cultural, and peaceful, with both water and land-based exploration."
  },
  {
    "destination": "Zanzibar, Tanzania", 
    "description": "A fascinating blend of Indian Ocean beaches, ancient stone towns, and rich cultural history. Zanzibar boasts white-sand beaches, spice farms, and a fascinating mix of Arab, Indian, and African influences. Accommodation varies from charming boutique hotels to luxurious resorts (like The Palms Zanzibar). Activities include exploring Stone Town, spice tours, snorkeling, diving in coral reefs, and visiting the historical spice plantations. The vibe is exotic, historical, and laid-back with plenty of opportunities for discovery and beachside relaxation."
  },
  {
    "destination": "Palawan, Philippines", 
    "description": "An island paradise with some of the most dramatic landscapes in Southeast Asia. Known for its crystal-clear lagoons, towering limestone cliffs, and remote islands, Palawan is a haven for nature lovers. Luxury resorts like Amanpulo cater to those seeking exclusivity, while more rustic accommodations are available. Activities include island-hopping, exploring underground rivers (like the Puerto Princesa Underground River), snorkeling, diving, and kayaking. The vibe is serene, adventurous, and nature-focused, ideal for those looking to disconnect."
  },
  {
    "destination": "Kauai, Hawaii, USA", 
    "description": "Known as the 'Garden Isle' for its lush, tropical landscape, Kauai is perfect for nature lovers and outdoor enthusiasts. From the dramatic cliffs of the Na Pali Coast to the vast Waimea Canyon, Kauai offers a mix of rugged adventure and natural beauty. Activities include hiking, zip-lining, snorkeling, and helicopter tours of the island's stunning landscapes. Accommodations range from beach resorts to charming B&Bs. The vibe is laid-back, adventurous, and deeply connected to nature, with less focus on luxury resorts compared to other Hawaiian islands."
  },
  {
    "destination": "Whitsunday Islands, Australia", 
    "description": "A cluster of stunning islands off the coast of Queensland, famous for their pristine beaches and crystal-clear waters. The Whitsundays are a top spot for sailing, diving, and water sports. The iconic Whitehaven Beach, with its powdery white silica sand, is a must-see. Luxury resorts and yacht charters are common here, offering unparalleled access to the Great Barrier Reef. Activities include snorkeling, diving, sailing, and beach picnics. The vibe is relaxed, maritime-focused, and perfect for those seeking both luxury and natural beauty."
  }
]